<a href="https://colab.research.google.com/github/345sarthak/Data-science-prc/blob/main/practical6_ipynp.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [27]:
import pandas as pd
import seaborn as sns
import numpy as np
df=pd.DataFrame({'Age':[19,23,45,56,67,49],
'Name':['sarthak','Akash','abhinay','rohan','ritik','kiran'],
'Roll no':[6272,6273,6274,6275,6276,6277],
'Marks':[77,34,89,12,23,68],
 'sex':['male','male','male','male','male','male']})
print(df)

   Age     Name  Roll no  Marks   sex
0   19  sarthak     6272     77  male
1   23    Akash     6273     34  male
2   45  abhinay     6274     89  male
3   56    rohan     6275     12  male
4   67    ritik     6276     23  male
5   49    kiran     6277     68  male

In [28]:
data=df['first Name']=df['Name'].str.split().str[0]
print(data)

0    sarthak
1      Akash
2    abhinay
3      rohan
4      ritik
5      kiran
Name: Name, dtype: object

In [29]:
mean_age=df['Age'].mean()
print(df)

   Age     Name  Roll no  Marks   sex first Name
0   19  sarthak     6272     77  male    sarthak
1   23    Akash     6273     34  male      Akash
2   45  abhinay     6274     89  male    abhinay
3   56    rohan     6275     12  male      rohan
4   67    ritik     6276     23  male      ritik
5   49    kiran     6277     68  male      kiran

In [30]:
df=df.rename(columns={'sex':'Gender'})
print(df)

   Age     Name  Roll no  Marks Gender first Name
0   19  sarthak     6272     77   male    sarthak
1   23    Akash     6273     34   male      Akash
2   45  abhinay     6274     89   male    abhinay
3   56    rohan     6275     12   male      rohan
4   67    ritik     6276     23   male      ritik
5   49    kiran     6277     68   male      kiran

In [31]:
df.groupby('Gender').agg({'Gender':'count'})

        Gender
Gender
male         6

In [32]:
sarthak=sns.load_dataset("titanic")
print(sarthak)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [34]:
sarthak['survived'].map(lambda x:'survived' if x==1 else 'not survived')

0      not survived
1          survived
2          survived
3          survived
4      not survived
           ...
886    not survived
887        survived
888    not survived
889        survived
890    not survived
Name: survived, Length: 891, dtype: object